# Используем официальный образ Node.js в качестве базового образа
FROM node:14-alpine

# Устанавливаем Docker внутри контейнера
RUN apk update && apk add docker

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы проекта в рабочую директорию
COPY . .

# Собираем приложение
RUN npm run build

# Указываем порт, который будет прослушивать контейнер
EXPOSE 5172

# Запускаем приложение при старте контейнера
CMD ["npm", "start", "--", "--port", "5172"]
